loading/artillery-server.yml
# scaling up from 10 RPS -> 1K rps in 50 sec intervals
# generated from bash:
# for i in `seq 10 10 1000` ; do
# echo '    - duration: 50' >> test.yml &&
# echo "      arrivalRate: ${i}" >> test.yml &&
# echo "      name: \"${i} RPS\"" >> test.yml ;
# done

config:
  target: "http://localhost:3000"
  phases:
    - duration: 50
      arrivalRate: 1
      name: "1 RPS"
    - duration: 50
      arrivalRate: 10
      name: "10 RPS"
    - duration: 50
      arrivalRate: 20
      name: "20 RPS"
    - duration: 50
      arrivalRate: 30
      name: "30 RPS"
    - duration: 50
      arrivalRate: 40
      name: "40 RPS"
    - duration: 50
      arrivalRate: 50
      name: "50 RPS"
    - duration: 50
      arrivalRate: 60
      name: "60 RPS"
    - duration: 50
      arrivalRate: 70
      name: "70 RPS"
    - duration: 50
      arrivalRate: 80
      name: "80 RPS"
    - duration: 50
      arrivalRate: 90
      name: "90 RPS"
    - duration: 50
      arrivalRate: 100
      name: "100 RPS"
    - duration: 50
      arrivalRate: 110
      name: "110 RPS"
    - duration: 50
      arrivalRate: 120
      name: "120 RPS"
    - duration: 50
      arrivalRate: 130
      name: "130 RPS"
    - duration: 50
      arrivalRate: 140
      name: "140 RPS"
    - duration: 50
      arrivalRate: 150
      name: "150 RPS"
    - duration: 50
      arrivalRate: 160
      name: "160 RPS"
    - duration: 50
      arrivalRate: 170
      name: "170 RPS"
    - duration: 50
      arrivalRate: 180
      name: "180 RPS"
    - duration: 50
      arrivalRate: 190
      name: "190 RPS"
    - duration: 50
      arrivalRate: 200
      name: "200 RPS"
    - duration: 50
      arrivalRate: 210
      name: "210 RPS"
    - duration: 50
      arrivalRate: 220
      name: "220 RPS"
    - duration: 50
      arrivalRate: 230
      name: "230 RPS"
    - duration: 50
      arrivalRate: 240
      name: "240 RPS"
    - duration: 50
      arrivalRate: 250
      name: "250 RPS"
    - duration: 50
      arrivalRate: 260
      name: "260 RPS"
    - duration: 50
      arrivalRate: 270
      name: "270 RPS"
    - duration: 50
      arrivalRate: 280
      name: "280 RPS"
    - duration: 50
      arrivalRate: 290
      name: "290 RPS"
    - duration: 50
      arrivalRate: 300
      name: "300 RPS"
    - duration: 50
      arrivalRate: 310
      name: "310 RPS"
    - duration: 50
      arrivalRate: 320
      name: "320 RPS"
    - duration: 50
      arrivalRate: 330
      name: "330 RPS"
    - duration: 50
      arrivalRate: 340
      name: "340 RPS"
    - duration: 50
      arrivalRate: 350
      name: "350 RPS"
    - duration: 50
      arrivalRate: 360
      name: "360 RPS"
    - duration: 50
      arrivalRate: 370
      name: "370 RPS"
scenarios:
  - flow:
    - get:
        url: "/"